; -----------------------------------------------------------------------------
;
; Universal Extractor Language File
; Written for Universal Extractor 1.6
; Author:	Jared Breland <jbreland@legroom.net>
; Homepage:	http://www.legroom.net/mysoft
;
; Translation Instructions:
;	Copy this file to a new file named after the new language
;		Eg: A language file for the German language would be named German.ini.
;	Replace the English words and phrases with their native equivalents,
;		attempting to match the English phrasing and case-sensitivity as
;		closely as possible for the sake of consistency
;	Update the Author and Homepage information at the top of your new language
;		file.  Simply delete the Homepage line if you don't have one.
;	Save the file in Unicode (UTF-8) format and Zip it to preserve formatting
;	E-mail new language files to jbreland@legroom.net for inclusion in main
;		Universal Extractor installer
;
;	The following symbols have special meanings:
;	& - when used in a GUI label or button, it precedes the letter that will
;		be registered as a "hotkey" for that function
;	%n - indicates a newline character, which will be replaced when displayed
;	%t - indicates a tab character, which will be replaced when displayed
;	%s - indicates a string variable that UniExtract will replace when displayed
;		The contents each %s variables is hardocded into UniExtract.
;		The order and number of %s variables is very important and should not
;		be modified.
;
; -----------------------------------------------------------------------------

[UniExtract]
; GUI labels and buttons
OK_BUT = "&OK"
CANCEL_BUT = "&Avbryt"
MAIN_DEST_DIR_LABEL = "&Mеlkatalog:"
MAIN_FILE_LABEL = "&Arkiv/Installer att Extrahera:"
MENU_FILE_LABEL = "&Fil"
MENU_FILE_QUIT_LABEL = "&Avsluta"
MENU_EDIT_LABEL = "&Bearbeta"
MENU_EDIT_PREFS_LABEL = "&Instдllningar"
MENU_HELP_LABEL = "&Hjдlp"
MENU_HELP_WEB_LABEL = "%s &Hemsida"
PREFS_TITLE_LABEL = "Instдllningar"
PREFS_UNIEXTRACT_OPTS_LABEL = "Universal Extractor Alternativ"
PREFS_HISTORY_LABEL = "Hеll Koll Pе Arkiv &Historik"
PREFS_FORMAT_OPTS_LABEL = "Format-Specifika Alternativ"
PREFS_LANG_LABEL = "&Sprеk"
PREFS_DEBUG_LABEL = "&Val Av (Debug) Filkatalog:"
PREFS_WARN_EXECUTE_LABEL = "&Varna Fцre Verkstдllande Av filer"
PREFS_REMOVE_DUPE_LABEL = "&Ta Bort Dubletter"
PREFS_REMOVE_TEMP_LABEL = "Ta Bort &temporдra Filer"
PREFS_APPEND_EXT_LABEL = "&Bifoga Saknade Filдndelser"
METHOD_ADMIN_RADIO = "%s Administrativ Installer"
METHOD_EXTRACTION_RADIO = "%s Extraktion"
METHOD_HEADER = "%s Extraktion"
METHOD_MSI_NOTE_LABEL = "Notering:"
METHOD_MSI_REQUIRES_LABEL = "msi2xml krдver"
METHOD_MSI_URL_LABEL = "MSXML 6.0 Tolk"
METHOD_RADIO_LABEL = "Extraherings Metod"
METHOD_SWITCH_RADIO = "%s Дndra"
METHOD_NOTIS_RADIO = "Inte En InstallShield-Installer"
METHOD_TEXT_LABEL = "%s Stцdjer Fцljande Metoder Att Extrahera %s Paket.  Tyvдrr, Ingen Av Dessa Metoder Дr 100% Tillfцrlitliga.  Utifall den fцrvalda metoden inte verkar fungera, prova igen %s och vдlj en alternativ metod."
METHOD_UNPACKER_RADIO = "%s Uppackare"

; GUI control functions
DOES_NOT_EXIST = "Existerar Ej.%n"
EXTRACT_TO = "Extrahera till"
INVALID_DIR_SELECTED =  "%s Дr Inte En Giltig Katalog."
INVALID_FILE_SELECTED = "%sVдnligen Vдlj En Giltig Fil."
OPEN_FILE = "Цppna Fil"
SELECT_FILE = "Vдlj Fil"
WRITE_TO = "Skriv Till"

; Common terms
TERM_ARCHIVE = "Arkiv"
TERM_COMPRESSED = "Komprimerad Fil"
TERM_DISK = "Disk"
TERM_EBOOK = "eBook"
TERM_ECARD = "eCard"
TERM_ENCODED = "Kodad Fil"
TERM_EXECUTABLE = "Kцrbar"
TERM_FAILED = "Misslyckades"
TERM_HELP = "Hjдlpfil"
TERM_HOTFIX = "Hotfix"
TERM_IMAGE = "Avbild"
TERM_INSTALLER = "Installer"
TERM_PACKAGE = "paket"
TERM_PATCH = "Patch"
TERM_SFX = "Sjдlv-Extraherande"
TERM_STAGE = "Steg"
TERM_SUCCEEDED = "Lyckades"
TERM_TESTING = "Testar"
TERM_UNKNOWN = "Okдnd"
TERM_UNPACKED = "Uppackad"
TERM_UPDATER = "Uppdaterare"

; Status messages
SCANNING_FILE = "Skannar Fil Fцr Att Avgцra Filetyp."
SCANNING_EXE = "Skannar Fil Med %s Scanner."
EXTRACTING = "Extraherar Filer Frеn:"
INIT_WAIT = "Vдntar Pе Installer Att Starta.%nVдnligen Vдnta."

; Custom prompts
CONVERT_CDROM = "%s CD-ROM Avbilder Kan Inte Extraheras Direkt.  Dдrfцr Kommer Denna Avbild%nAtt Konverteras Till En ISO CD-ROM Avbild, Som Dдrefter Kommer Att Extraheras.%n%nVill Du Fortsдtta?%nNotering: Denna Process Kommer Att Ta Flera Minuter."
CONVERT_CDROM_STAGE1_FAILED = "Felmeddelande:  CD-ROM Avbilden Kunde Inte Konverteras.%nOm Detta Дr En BIN/CUE Avbild, Sдkerstдll Att CUE filen Дe Korrekt formaterad."
CONVERT_CDROM_STAGE2_FAILED = "Felmeddelande:  En ISO Image Skapades Frеn %s Avbilden, Men Kunde Inte Konverteras.%nVill Du Behеlla ISO Imagen Fцr Vidare Analys?"
CONVERT_BIN_MISSING = "Felmeddelande: Kan Inte Hitta:%n%s\%s.%s%n%nBеde %s.bin Och %s.cue Behцvs."
INIT_COMPLETE = "Initiering %s.  Vдnligen Stдng Installern, Klicka Sedan OK Fцr Att Fortsдtta."
WISE_MSI_PROMPT = "Notering:  Den Hдr Metoden Fungerar Endast Med Specifikt "Wise for Windows Installer" Paket.%nIfall "Wise Installation Wizard" Startar Och Bara Vдntar Pе Input, Stцds Ej Dennat%nFilen.  Vдnligen Avsluta Installern, Och %s Kommer Att Avbryta Extraheringen.%n%nVill Du Fortsдtta?"
UNPACK_PROMPT = "Den Hдr Filen Дr Packad Med %s Kompression, Men Kunde Inte Extraheras.%nDett Kan Bero Pе Att Filtypen Inte Stцds, Eller Fцr Att%nDдr Helt Enkelt Inte Finns Nеgra Filer Att Extrahera.%n%nVill Du Packa Upp Filen Istдllet?%n%nNotering: Den Uppackade Filen Kommer Att Namnges Som:%n%s\%s_unpacked.%s"
UNPACK_FAILED = "Felmeddelande:  %s%nKunde Ej Packas Upp."
WARN_EXECUTE = "Varning:  Fцr Att Kunna Extrahera Filer Av Den Hдr Typen, Mеste Filen Verkstдllas Direkt.%nIfall Du Fortsдtter, Kцrs Fцljande Direktiv:%n%n%s%n%nIfall Du Misstдnker Att Filen Mцjligen Kan Vara Ett Virus, Rekommenderas Att Du Inte Fortsдtter.%nVill Du Fortsдtta Med Extraheringen?"

; Help text
HELP_SUMMARY = "Extrahera Filer Frеn Alla Arkivtyper Eller Installers."
HELP_SYNTAX = "%nBelastning:  %s [/help | /prefs] [filename [destination]]"
HELP_ARGUMENTS = "%n%nStцdda Argument:"
HELP_HELP = "%n     /help%t%tVisa Hjдlpinformation"
HELP_PREFS = "%n     /prefs%t%tДndra UniExtract Instдllningar"
HELP_FILENAME = "%n     filename%tNamn Pе Fil Att Extrahera"
HELP_DESTINATION = "%n     destination%tKatalog (Mapp) Att Extrahera Till"
HELP_SUB = "%n%nFцr Att Extrahera Till En Annan Mеlkatalog Дn Den Nuvarande, Vдlj%n%s Att Extrahera Till En Underkatalog Namngiven Efter Arkivet."
HELP_EXAMPLE1 = "%n%nExempel:"
HELP_EXAMPLE2 = "%n     %s c:\1\example.zip c:\test"
HELP_NOARGS = "%n%nKцrs %s Utan Nеgra Argument Kommer%nAtt Frеga Anvдndaren Efter Filnamn Och Mеlkatalog."

; Error messages
CANNOT_LOG = "%s Extraktionen Kan Inte Loggas."
CANNOT_DEBUG = "Korrigerings Filen, "%s", Дr Inte Skrivbar.%nDin temp Katalog Kommer Att Anvдndas Istдllet."
CANNOT_EXTRACT = "%s Kan Ej Extraheras.%nЕtersдnd Filtyp Var: %s%n%nKlicka "OK" Om Du Vill Analysera Filen Sjдlva, Eller "Cancel Fцr Att Avsluta."
UNKNOWN_EXT = "%s%nhas an unknown extension and cannot be extracted."
INVALID_DIR = "%s%nKunde Inte Skapas.  Vдnligen Vдlj En Giltig Destination."
EXTRACT_FAILED = "%s Kunde Ej Extraheras.%nDet Verkar Vara En(n) %s, Som Stцds, Men Extraktion Misslyckades.%nVдnligen Kontrollera Logg Filen, %s, Fцr Mer Information.%n%nKlicka "OK" Fцr Att Se Loggfilen Nu, Eller "Cancel" Fцr Att Avsluta."

[Installer]
; Components page
COMP_DOCS = "Dokumentation Och Licens Information"
COMP_LANG = "Sprеkfiler Fцr Internationell Support"
COMP_ACE = "Support Fцr ACE Filer"
COMP_KGB = "Support Fцr KGB File"
COMP_PEA = "Support Fцr Pea Filer"
COMP_SIT = "Support Fцr StuffIt Filer"

; Preferences page
PREFS_CAPTION = "Program Instдllningar"
PREFS_DESCRIPTION = "Vilka Universal Extractor Instдllningar Vill Du Stдlla In?"
PREFS_LABEL1 = "Du Kan Vдlja Fцljande Instдllningar Fцr Att Modifiera Universal Extractor's Standardinstдllningar."
PREFS_LABEL2 = "Dessa Instдllningar Kan Modifieras Efter Installationen Genom Att Дndra UniExtract.ini."
LANGUAGE_LABEL = "Standard Sprеk"
DEBUG_LABEL = "Lokalisering Av "Debug Filen""
APPEND_EXT_LABEL = "&Append Saknade Filдndelser"
HISTORY_LABEL = "&Bibehеll Arkiv Historik"
REMOVE_DUPE_LABEL = "Ta Bort &Dublett Filer"
REMOVE_TEMP_LABEL = "Ta Bort &temporдra Filer"
WARN_EXECUTE_LABEL = "&Varna Fцre Verkstдllande Av Filer"

; Tasks page
ASSOCIATE = "&Aktivera Explorer Menyintegration"
ASSOCIATE_FILES = "Lдgg Till UniExtract &Filer... Till Menyer"
ASSOCIATE_HERE = "Lдgg Till UniExtract &Hдr Till Menyer"
ASSOCIATE_SUBDIR = "Lдgg Till UniExtract Till &Underkatalog Menyer"
ASSOCIATE_FORCE = "Tvinga &Association Med Alla Stцdda Arkivformat"
MODIFY_PATH = "Lдgg Universal Extractor till systemet och &sцkvдgen"
DESKTOP_ICON = "Skapa En &Skrivbords Ikon"
QUICK_LAUNCH_ICON = "Skapa En &Snabbstarts Ikon"
SENDTO_ICON = "Skapa En Skicka&Till Ikon"

; Context Menu integration
EXTRACT_FILES = "UniExtract &Filer..."
EXTRACT_HERE = "UniExtract &Hдr"
EXTRACT_SUB = "UniExtract Till &Underkatalog"
